# TorsionalModulus Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSection..::..TorsionalModulus Property
StructuralSection Class See Also
---
Section modulus for calculations of torsion stresses (Ct).
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double TorsionalModulus { get; set; }
```

Visual Basic
---
```text
Public Property TorsionalModulus As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TorsionalModulus {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace